; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v7 ?v6)
             (pred_2 ?v9 ?v12)
             (pred_1 ?v7 ?v12)
             (pred_4 ?v10 ?v7 )
	     (pred_11 ?v7)
             (pred_5 ?v8)
             (pred_8 ?v9)
             (pred_7 ?v12)
             (pred_6 ?v7)
             (pred_9 ?v9)
             (pred_10 ?v7)
             (pred_3 ))



(:action op_2
:parameters (?v4 ?v11 ?v1 ?v5)
:precondition (and (pred_5 ?v4) (pred_5 ?v11) (pred_8 ?v1) (pred_7 ?v5)
          (pred_12 ?v4 ?v11) (pred_2 ?v1 ?v5)
                   (pred_1 ?v11 ?v5) (pred_11 ?v4) 
                   (pred_6 ?v11) (pred_9 ?v1))
:effect (and  (pred_10 ?v11) (not (pred_6 ?v11))))


(:action op_4
:parameters (?v4 ?v13)
:precondition (and (pred_5 ?v4) (pred_5 ?v13)
               (pred_11 ?v4) (pred_12 ?v4 ?v13) (pred_10 ?v13))
:effect (and (pred_11 ?v13) (not (pred_11 ?v4))))

(:action op_3
:parameters (?v4 ?v1)
:precondition (and (pred_5 ?v4) (pred_8 ?v1) 
                  (pred_11 ?v4) (pred_4 ?v1 ?v4) (pred_3 ))
:effect (and (pred_9 ?v1)
   (not (pred_4 ?v1 ?v4)) (not (pred_3 ))))


(:action op_1
:parameters (?v4 ?v2 ?v3)
:precondition (and (pred_5 ?v4) (pred_8 ?v2) (pred_8 ?v3)
                  (pred_11 ?v4) (pred_9 ?v3) (pred_4 ?v2 ?v4))
:effect (and (pred_9 ?v2) (pred_4 ?v3 ?v4)
        (not (pred_9 ?v3)) (not (pred_4 ?v2 ?v4))))

(:action op_5
:parameters (?v4 ?v1)
:precondition (and (pred_5 ?v4) (pred_8 ?v1) 
                  (pred_11 ?v4) (pred_9 ?v1))
:effect (and (pred_3 ) (pred_4 ?v1 ?v4) (not (pred_9 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_04 obj_06 obj_09 obj_12 obj_01 obj_02 obj_14 obj_05 obj_13 obj_07 obj_17 obj_21 obj_11 obj_19 obj_16
    obj_15 obj_20
    obj_08 obj_18 obj_03
    )

    (:init
       (pred_3)

       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_14)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_5 obj_16)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_8 obj_03)

       (pred_12 obj_10 obj_12)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_04 obj_01)
       (pred_12 obj_04 obj_06)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_06 obj_04)
       (pred_12 obj_09 obj_14)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_12 obj_10)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_02 obj_14)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_14 obj_09)
       (pred_12 obj_14 obj_02)
       (pred_12 obj_05 obj_21)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_13 obj_01)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_17)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_17 obj_16)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_07)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_21 obj_05)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_16 obj_17)
       (pred_12 obj_16 obj_19)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_05)
       (pred_1  obj_13 obj_15)
       (pred_1  obj_02 obj_20)
       (pred_1  obj_05 obj_20)
       (pred_10 obj_10)
       (pred_10 obj_04)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_01)
       (pred_10 obj_14)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_21)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_16)

       (pred_2  obj_08 obj_15)
       (pred_2  obj_18 obj_20)
       (pred_2  obj_03 obj_20)
       (pred_4 obj_08 obj_12)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_03 obj_21)
       (pred_11 obj_04)
    )

    (:goal (and
       (pred_4 obj_03 obj_10)
    ))
(:constraints
  (always (not (pred_11 obj_13)))
)
)

; plan
1. (op_4 obj_04 obj_10)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_10)
   goals met: 0 of 1
2. (op_4 obj_10 obj_12)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_12)
   goals met: 0 of 1
3. (op_3 obj_12 obj_08)
   deleted: (pred_4 obj_08 obj_12) (pred_3)
   added: (pred_9 obj_08)
   goals met: 0 of 1
4. (op_4 obj_12 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_10)
   goals met: 0 of 1
5. (op_5 obj_10 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_3) (pred_4 obj_08 obj_10)
   goals met: 0 of 1
6. (op_4 obj_10 obj_04)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_04)
   goals met: 0 of 1
7. (op_4 obj_04 obj_06)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_06)
   goals met: 0 of 1
8. (op_3 obj_06 obj_18)
   deleted: (pred_4 obj_18 obj_06) (pred_3)
   added: (pred_9 obj_18)
   goals met: 0 of 1
9. (op_4 obj_06 obj_04)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_04)
   goals met: 0 of 1
10. (op_4 obj_04 obj_10)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_10)
   goals met: 0 of 1
11. (op_4 obj_10 obj_12)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_12)
   goals met: 0 of 1
12. (op_2 obj_12 obj_05 obj_18 obj_20)
   deleted: (pred_6 obj_05)
   added: (pred_10 obj_05)
   goals met: 0 of 1
13. (op_4 obj_12 obj_05)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_05)
   goals met: 0 of 1
14. (op_4 obj_05 obj_21)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_21)
   goals met: 0 of 1
15. (op_1 obj_21 obj_03 obj_18)
   deleted: (pred_9 obj_18) (pred_4 obj_03 obj_21)
   added: (pred_9 obj_03) (pred_4 obj_18 obj_21)
   goals met: 0 of 1
16. (op_4 obj_21 obj_05)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_05)
   goals met: 0 of 1
17. (op_4 obj_05 obj_12)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_12)
   goals met: 0 of 1
18. (op_4 obj_12 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_10)
   goals met: 0 of 1
19. (op_1 obj_10 obj_08 obj_03)
   deleted: (pred_9 obj_03) (pred_4 obj_08 obj_10)
   added: (pred_9 obj_08) (pred_4 obj_03 obj_10)
   goals met: 1 of 1
